# AssociatedBuildingPadId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TopographySurface..::..AssociatedBuildingPadId Property
TopographySurface Class See Also
---
The element id of the building pad which causes this topography surface to be formed.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId AssociatedBuildingPadId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AssociatedBuildingPadId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ AssociatedBuildingPadId {
	ElementId^ get ();
}
```

# Remarks
InvalidElementId returned signals that there is no associated building pad.
# See Also
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace